#Область ОписаниеПеременных

// СканерШтрихкодовAndroid
Перем глПараметрыСканераШтрихкодовAndroid Экспорт;
// Конец СканерШтрихкодовAndroid

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// СканерШтрихкодовAndroid
	МенеджерСканераШтрихкодовAndroidКлиент.УстановитьПараметрыСканера();
	// Конец СканерШтрихкодовAndroid
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// СканерШтрихкодовAndroid
	глПараметрыСканераШтрихкодовAndroid.СобытиеОбработано = Ложь;
	МенеджерСканераШтрихкодовAndroidКлиент.ОбработатьСобытие(Источник, Событие, Данные);
	// Конец СканерШтрихкодовAndroid
	
КонецПроцедуры

#КонецОбласти 

#Область Инициализация

// СканерШтрихкодовAndroid
глПараметрыСканераШтрихкодовAndroid = Новый Структура;
// Конец СканерШтрихкодовAndroid

#КонецОбласти