///////////////////////////////////////////////////////////////////////////////////////////////////////
// (с) Tolkachev Pavel, 2020
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает параметры сканера штрихкодов.
// 
// Возвращаемое значение:
//  Структура - параметры сканера штрихкодов:
//    * УстройствоИспользуется - Булево - Истина, если сканер штрихкодов используется в приложении.
//    * ActionName - Строка - значение action для IntentFilter событий сканера (broadcast) в системе Android.
//                            Определяется производителем устройства. Обычно, находится в настройках сканера. Свойство
//                            отсутствует, если параметры сканера не заданы.
//    * ExtraData - Строка - значение Intent, из которого извлекается штрих код. Определяется производителем устройства.
//                           Обычно, находится в настройках сканера. Свойство отсутствует, если параметры сканера не
//                           заданы.
//    * СканерШтрихкодов - Структура - описание объекта подключенного сканера. Устройство подключается при открытии
//                                     формы. Свойство заполнено, если есть хотя бы одна форма клиенского приложения в
//                                     данный момент работает со сканером. При закрытии последней (или единственной)
//                                     формы, работающей со сканером, значение свойства становится Неопределно.
//       * ОбъектДрайвера - ВнешняяКомпонента - объект, созданный из внешней компоненты драйвера для вызова его методов.
//       * Клиенты - Массив - массив идентификаторов открытых форм, которые работают со сканером. При открытии новой
//                            формы клиентского приложения, работающей со сканером, её идентификатор добавляется в этот
//                            массив. При закрытии идентификатор этой формы удаляется из массива. При закрытии последней
//                            формы устройство будет отключено.
//       * КоличествоПодключенных - Число - количество подключенных форм клиентского приложения.
//                           
//    * СобытиеОбработано - Булево - используется для предотвращения повторной обработки события.
//
Функция ПолучитьПараметрыСканера() Экспорт
	
	ПараметрыСканераХранилище = Константы.ПараметрыСканераШтрихкодовAndroid.Получить();
	ПараметрыСканера = ПараметрыСканераХранилище.Получить();
	
	Если ПараметрыСканера = Неопределено Тогда
		ПараметрыСканера = Новый Структура;
	КонецЕсли; 
	
	ПараметрыСканера.Вставить("УстройствоИспользуется",
		Константы.ИспользоватьСканерШтрихкодовAndroid.Получить()
			 И Константы.ДрайверСканераШтрихкодовAndroidУстановлен.Получить()
	);
	ПараметрыСканера.Вставить("Сканер", Неопределено);
	ПараметрыСканера.Вставить("СобытиеОбработано", Ложь);
		
	Возврат ПараметрыСканера;
	
КонецФункции 

#КонецОбласти